openwch/ch55x/4,CH559 operates Barcode Scanner/USBH_ScannerKey.C
/*
****************************************
**  Copyright  (C)  W.ch  1999-2015   **
**  Web:              http://wch.cn   **
****************************************
*/
/* USB host example for CH559, CH559操作扫码枪，直接字符输出或者源码输出*/

/* C51   TEST.C */
/* LX51  TEST.OBJ */
/* OHX51 TEST */

#include <CH559.H>
#include <stdio.h>
#include <string.h>

// 各子程序返回状态码
#define	ERR_SUCCESS			0x00	// 操作成功
#define	ERR_USB_CONNECT		0x15	/* 检测到USB设备连接事件,已经连接 */
#define	ERR_USB_DISCON		0x16	/* 检测到USB设备断开事件,已经断开 */
#define	ERR_USB_BUF_OVER	0x17	/* USB传输的数据有误或者数据太多缓冲区溢出 */
#define	ERR_USB_DISK_ERR	0x1F	/* USB存储器操作失败,在初始化时可能是USB存储器不支持,在读写操作中可能是磁盘损坏或者已经断开 */
#define	ERR_USB_TRANSFER	0x20	/* NAK/STALL等更多错误码在0x20~0x2F */
#define	ERR_USB_UNSUPPORT	0xFB
#define	ERR_USB_UNKNOWN		0xFE

// 获取设备描述符
UINT8C	SetupGetDevDescr[] = { USB_REQ_TYP_IN, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_DEVICE, 0x00, 0x00, sizeof( USB_DEV_DESCR ), 0x00 };
// 获取配置描述符
UINT8C	SetupGetCfgDescr[] = { USB_REQ_TYP_IN, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_CONFIG, 0x00, 0x00, 0x04, 0x00 };
// 设置USB地址
UINT8C	SetupSetUsbAddr[] = { USB_REQ_TYP_OUT, USB_SET_ADDRESS, USB_DEVICE_ADDR, 0x00, 0x00, 0x00, 0x00, 0x00 };
// 设置USB配置
UINT8C	SetupSetUsbConfig[] = { USB_REQ_TYP_OUT, USB_SET_CONFIGURATION, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
// 清除端点STALL
UINT8C	SetupClrEndpStall[] = { USB_REQ_TYP_OUT | USB_REQ_RECIP_ENDP, USB_CLEAR_FEATURE, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
// 获取HUB描述符
UINT8C	SetupGetHubDescr[] = { HUB_GET_HUB_DESCRIPTOR, HUB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_HUB, 0x00, 0x00, sizeof( USB_HUB_DESCR ), 0x00 };
// 获取HID设备报表描述符
UINT8C	SetupGetHIDDevReport[] = { 0x81, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_REPORT, 0x00, 0x00, 0x49, 0x00 };
// SET_Report
UINT8C	SetupSetKeyReport[] = { 0x21, 0x09, 0x00, 0x02, 0x00, 0x00, 0x01, 0x00 };

UINT8X	UsbDevEndp0Size;	/* USB设备的端点0的最大包尺寸 */

//USB设备相关信息表,CH559最多支持2个设备
#define	ROOT_DEV_DISCONNECT		0
#define	ROOT_DEV_CONNECTED		1
#define	ROOT_DEV_FAILED			2
#define	ROOT_DEV_SUCCESS		3

#define	DEV_TYPE_KEYBOARD	( USB_DEV_CLASS_HID | 0x20 )
#define	DEV_TYPE_MOUSE		( USB_DEV_CLASS_HID | 0x30 )

UINT8 Set_Port = 0;
struct _RootHubDev{
	UINT8	DeviceStatus;			// 设备状态,0-无设备,1-有设备但尚未初始化,2-有设备但初始化枚举失败,3-有设备且初始化枚举成功
	UINT8	DeviceAddress;		// 设备被分配的USB地址
	UINT8	DeviceSpeed;			// 0为低速,非0为全速
	UINT8	DeviceType;				// 设备类型
//	union {
//		struct MOUSE {
//			UINT8	MouseInterruptEndp;		// 鼠标中断端点号
//			UINT8	MouseIntEndpTog;		// 鼠标中断端点的同步标志
//			UINT8	MouseIntEndpSize;		// 鼠标中断端点的长度
//		}
//		struct PRINT {
//		}
//	}
//.....    struct  _Endp_Attr   Endp_Attr[4];	//端点的属性,最多支持4个端点
	UINT8	GpVar;					// 通用变量
	UINT8	GpVar1;					// 通用变量1
} xdata RootHubDev[2];

#define	HUB_MAX_PORTS	4

/*
约定: USB设备地址分配规则(参考USB_DEVICE_ADDR)
地址值  设备位置
0x02    内置Root-HUB0下的USB设备或外部HUB
0x03    内置Root-HUB1下的USB设备或外部HUB
0x1x    内置Root-HUB0下的外部HUB的端口x下的USB设备,x为1~n
0x2x    内置Root-HUB1下的外部HUB的端口x下的USB设备,x为1~n
*/

struct _DevOnHubPort{
	UINT8	DeviceStatus;			// 设备状态,0-无设备,1-有设备但尚未初始化,2-有设备但初始化枚举失败,3-有设备且初始化枚举成功
	UINT8	DeviceAddress;			// 设备被分配的USB地址
	UINT8	DeviceSpeed;			// 0为低速,非0为全速
	UINT8	DeviceType;				// 设备类型
//.....    struct  _Endp_Attr   Endp_Attr[4];	//端点的属性,最多支持4个端点
	UINT8	GpVar;					// 通用变量
} xdata DevOnHubPort[2][HUB_MAX_PORTS];  // 假定:不超过2个外部HUB,每个外部HUB不超过HUB_MAX_PORTS个端口(多了不管)

UINT8X	RxBuffer[ MAX_PACKET_SIZE ] _at_ 0x0000 ;  // IN, must even address
UINT8X	TxBuffer[ MAX_PACKET_SIZE ] _at_ 0x0100 ;  // OUT, must even address
#define	pSetupReq	((PXUSB_SETUP_REQ)TxBuffer)
bit		RootHubId;		// 当前正在操作的root-hub端口号:0=HUB0,1=HUB1
bit		FoundNewDev;

//sbit LED_RUN  = P1^0;
//sbit LED_CFG  = P1^1;
//sbit LED_TMP  = P1^2;

#pragma NOAREGS

void	mDelayuS( UINT16 n );  // 以uS为单位延时

void	mDelaymS( UINT16 n );  // 以mS为单位延时

void	DisableRootHubPort( UINT8 RootHubIndex );  // 关闭指定的ROOT-HUB端口,实际上硬件已经自动关闭,此处只是清除一些结构状态

UINT8	AnalyzeRootHub( void );   // 分析ROOT-HUB状态,处理ROOT-HUB端口的设备插拔事件
// 返回ERR_SUCCESS为没有情况,返回ERR_USB_CONNECT为检测到新连接,返回ERR_USB_DISCON为检测到断开

void	SetHostUsbAddr( UINT8 addr );  // 设置USB主机当前操作的USB设备地址

void	SetUsbSpeed( UINT8 FullSpeed );  // 设置当前USB速度

void	ResetRootHubPort( UINT8 RootHubIndex );  // 检测到设备后,复位相应端口的总线,为枚举设备准备,设置为默认为全速

UINT8	EnableRootHubPort( UINT8 RootHubIndex );  // 使能ROOT-HUB端口,相应的bUH_PORT_EN置1开启端口,设备断开可能导致返回失败

void	SelectHubPort( UINT8 RootHubIndex, UINT8 HubPortIndex );  // HubPortIndex=0选择操作指定的ROOT-HUB端口,否则选择操作指定的ROOT-HUB端口的外部HUB的指定端口

#define	WAIT_USB_TOUT_200US		200  // 等待USB中断超时时间200uS@Fsys=12MHz
UINT8	WaitUSB_Interrupt( void );  // 等待USB中断

// CH559传输事务,输入目的端点地址/PID令牌,同步标志,以20uS为单位的NAK重试总时间(0则不重试,0xFFFF无限重试),返回0成功,超时/出错重试
UINT8	USBHostTransact( UINT8 endp_pid, UINT8 tog, UINT16 timeout );  // endp_pid: 高4位是token_pid令牌, 低4位是端点地址

UINT8	HostCtrlTransfer( PUINT8X DataBuf, PUINT8I RetLen );  // 执行控制传输,8字节请求码在pSetupReq中,DataBuf为可选的收发缓冲区
// 如果需要接收和发送数据,那么DataBuf需指向有效缓冲区用于存放后续数据,实际成功收发的总长度返回保存在ReqLen指向的字节变量中

void	CopySetupReqPkg( PUINT8C pReqPkt );  // 复制控制传输的请求包

UINT8	CtrlGetDeviceDescr( void );  // 获取设备描述符,返回在TxBuffer中

UINT8	CtrlGetConfigDescr( void );  // 获取配置描述符,返回在TxBuffer中

UINT8	CtrlSetUsbAddress( UINT8 addr );  // 设置USB设备地址

UINT8	CtrlSetUsbConfig( UINT8 cfg );  // 设置USB设备配置

UINT8	CtrlClearEndpStall( UINT8 endp );  // 清除端点STALL

UINT8	CtrlGetHubDescr( void );  // 获取HUB描述符,返回在TxBuffer中

UINT8	HubGetPortStatus( UINT8 HubPortIndex );  // 查询HUB端口状态,返回在TxBuffer中

UINT8	HubSetPortFeature( UINT8 HubPortIndex, UINT8 FeatureSelt );  // 设置HUB端口特性

UINT8	HubClearPortFeature( UINT8 HubPortIndex, UINT8 FeatureSelt );  // 清除HUB端口特性

UINT8	AnalyzeHidIntEndp( PUINT8X buf );  // 从描述符中分析出HID中断端点的地址

UINT8	InitRootDevice( UINT8 RootHubIndex );  // 初始化指定ROOT-HUB端口的USB设备
// 输入: 内置HUB端口号0/1

UINT8	EnumAllRootDevice( void );  // 枚举所有ROOT-HUB端口的USB设备

UINT8	InitDevOnHub( UINT8 RootHubIndex, UINT8 HubPortIndex );  // 初始化枚举外部HUB后的二级USB设备

UINT8	EnumHubPort( UINT8 RootHubIndex );  // 枚举指定ROOT-HUB端口上的外部HUB集线器的各个端口,检查各端口有无连接或移除事件并初始化二级USB设备

UINT8	EnumAllHubPort( void );  // 枚举所有ROOT-HUB端口下外部HUB后的二级USB设备

UINT16	SearchTypeDevice( UINT8 type );  // 在ROOT-HUB以及外部HUB各端口上搜索指定类型的设备所在的端口号,输出端口号为0xFFFF则未搜索到
// 输出高8位为ROOT-HUB端口号,低8位为外部HUB的端口号,低8位为0则设备直接在ROOT-HUB端口上

/* 为printf和getkey输入输出初始化串口 */
void	mInitSTDIO( void );

void	InitUSB_Host( void );  // 初始化USB主机

#define	FREQ_SYS	24000000	// 系统主频20MHz

void	mDelayuS( UINT16 n )  // 以uS为单位延时
{
	while ( n ) {  // total = 12~13 Fsys cycles, 1uS @Fsys=12MHz
		++ SAFE_MOD;  // 2 Fsys cycles, for higher Fsys, add operation here
#ifdef	FREQ_SYS
#if		FREQ_SYS >= 14000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 16000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 18000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 20000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 22000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 24000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 26000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 28000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 30000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 32000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 34000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 36000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 38000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 40000000
		++ SAFE_MOD;
#endif
#endif
		-- n;
	}
}

