openwch/ch55x/4,CH559 operates Barcode Scanner/USBH_ScannerKey.C
void	mDelaymS( UINT16 n )  // 以mS为单位延时
{
	while ( n ) {
		mDelayuS( 1000 );
		-- n;
	}
}

void	DisableRootHubPort( UINT8 RootHubIndex )  // 关闭指定的ROOT-HUB端口,实际上硬件已经自动关闭,此处只是清除一些结构状态
{
	RootHubDev[ RootHubIndex ].DeviceStatus = ROOT_DEV_DISCONNECT;
	RootHubDev[ RootHubIndex ].DeviceAddress = 0x00;
	if ( RootHubIndex == 1 ) UHUB1_CTRL = 0x00;  // 清除有关HUB1的控制数据,实际上不需要清除
	else UHUB0_CTRL = 0x00;  // 清除有关HUB0的控制数据,实际上不需要清除
//	printf( "HUB %01x close\n",(UINT16)RootHubIndex );
}

UINT8	AnalyzeRootHub( void )   // 分析ROOT-HUB状态,处理ROOT-HUB端口的设备插拔事件
// 返回ERR_SUCCESS为没有情况,返回ERR_USB_CONNECT为检测到新连接,返回ERR_USB_DISCON为检测到断开
{ //处理HUB端口的插拔事件,如果设备拔出,函数中调用DisableRootHubPort()函数,将端口关闭,插入事件,置相应端口的状态位
	UINT8	s;
	s = ERR_SUCCESS;
	if ( USB_HUB_ST & bUHS_H0_ATTACH ) {  // 设备存在
		if ( RootHubDev[0].DeviceStatus == ROOT_DEV_DISCONNECT  // 检测到有设备插入
			|| ( UHUB0_CTRL & bUH_PORT_EN ) == 0x00 ) {  // 检测到有设备插入,但尚未允许,说明是刚插入
			DisableRootHubPort( 0 );  // 关闭端口
//			RootHubDev[0].DeviceSpeed = USB_HUB_ST & bUHS_DM_LEVEL ? 0 : 1;
			RootHubDev[0].DeviceStatus = ROOT_DEV_CONNECTED;  //置连接标志
			printf( "HUB 0 dev in\n" );
			s = ERR_USB_CONNECT;
		}
	}
	else if ( RootHubDev[0].DeviceStatus >= ROOT_DEV_CONNECTED ) {  //检测到设备拔出
		DisableRootHubPort( 0 );  // 关闭端口
		printf( "HUB 0 dev out\n" );
		if ( s == ERR_SUCCESS ) s = ERR_USB_DISCON;
	}
	if ( USB_HUB_ST & bUHS_H1_ATTACH ) {  // 设备存在
		if ( RootHubDev[1].DeviceStatus == ROOT_DEV_DISCONNECT  // 检测到有设备插入
			|| ( UHUB1_CTRL & bUH_PORT_EN ) == 0x00 ) {  // 检测到有设备插入,但尚未允许,说明是刚插入
			DisableRootHubPort( 1 );  // 关闭端口
//			RootHubDev[1].DeviceSpeed = USB_HUB_ST & bUHS_HM_LEVEL ? 0 : 1;
			RootHubDev[1].DeviceStatus = ROOT_DEV_CONNECTED;  //置连接标志
			printf( "HUB 1 dev in\n" );
			s = ERR_USB_CONNECT;
		}
	}
	else if ( RootHubDev[1].DeviceStatus >= ROOT_DEV_CONNECTED ) {  //检测到设备拔出
		DisableRootHubPort( 1 );  // 关闭端口
		printf( "HUB 1 dev out\n" );
		if ( s == ERR_SUCCESS ) s = ERR_USB_DISCON;
	}
//	UIF_DETECT = 0;  // 清中断标志
	return( s );
}

void	SetHostUsbAddr( UINT8 addr )  // 设置USB主机当前操作的USB设备地址
{
	USB_DEV_AD = USB_DEV_AD & bUDA_GP_BIT | addr & 0x7F;
}

void	SetUsbSpeed( UINT8 FullSpeed )  // 设置当前USB速度
{
	if ( FullSpeed ) {  // 全速
		USB_CTRL &= ~ bUC_LOW_SPEED;  // 全速
		UH_SETUP &= ~ bUH_PRE_PID_EN;  // 禁止PRE PID
	}
	else {
		USB_CTRL |= bUC_LOW_SPEED;  // 低速
	}
}

void	ResetRootHubPort( UINT8 RootHubIndex )  // 检测到设备后,复位相应端口的总线,为枚举设备准备,设置为默认为全速
{
	UsbDevEndp0Size = DEFAULT_ENDP0_SIZE;  /* USB设备的端点0的最大包尺寸 */
	SetHostUsbAddr( 0x00 );
	SetUsbSpeed( 1 );  // 默认为全速
	if ( RootHubIndex == 1 ) {
		UHUB1_CTRL = UHUB1_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET;  // 默认为全速,开始复位
		mDelaymS( 15 );  // 复位时间10mS到20mS
		UHUB1_CTRL = UHUB1_CTRL & ~ bUH_BUS_RESET;  // 结束复位
	}
	else {
		UHUB0_CTRL = UHUB0_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET;  // 默认为全速,开始复位
		mDelaymS( 15 );  // 复位时间10mS到20mS
		UHUB0_CTRL = UHUB0_CTRL & ~ bUH_BUS_RESET;  // 结束复位
	}
	mDelayuS( 250 );
	UIF_DETECT = 0;  // 清中断标志
}

UINT8	EnableRootHubPort( UINT8 RootHubIndex )  // 使能ROOT-HUB端口,相应的bUH_PORT_EN置1开启端口,设备断开可能导致返回失败
{
	if ( RootHubDev[ RootHubIndex ].DeviceStatus < ROOT_DEV_CONNECTED ) RootHubDev[ RootHubIndex ].DeviceStatus = ROOT_DEV_CONNECTED;
	if ( RootHubIndex == 1 ) {
		if ( USB_HUB_ST & bUHS_H1_ATTACH ) {  // 有设备
			if ( ( UHUB1_CTRL & bUH_PORT_EN ) == 0x00 ) {  // 尚未使能
				RootHubDev[1].DeviceSpeed = USB_HUB_ST & bUHS_HM_LEVEL ? 0 : 1;
				if ( RootHubDev[1].DeviceSpeed == 0 ) UHUB1_CTRL |= bUH_LOW_SPEED;  // 低速
			}
			UHUB1_CTRL |= bUH_PORT_EN;  //使能HUB端口
			return( ERR_SUCCESS );
		}
	}
	else {
		if ( USB_HUB_ST & bUHS_H0_ATTACH ) {  // 有设备
			if ( ( UHUB0_CTRL & bUH_PORT_EN ) == 0x00 ) {  // 尚未使能
				RootHubDev[0].DeviceSpeed = USB_HUB_ST & bUHS_DM_LEVEL ? 0 : 1;
				if ( RootHubDev[0].DeviceSpeed == 0 ) UHUB0_CTRL |= bUH_LOW_SPEED;  // 低速
			}
			UHUB0_CTRL |= bUH_PORT_EN;  //使能HUB端口
			return( ERR_SUCCESS );
		}
	}
	return( ERR_USB_DISCON );
}

void	SelectHubPort( UINT8 RootHubIndex, UINT8 HubPortIndex )  // HubPortIndex=0选择操作指定的ROOT-HUB端口,否则选择操作指定的ROOT-HUB端口的外部HUB的指定端口
{
	if ( HubPortIndex ) {  // 选择操作指定的ROOT-HUB端口的外部HUB的指定端口
		SetHostUsbAddr( DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceAddress );  // 设置USB主机当前操作的USB设备地址
		if ( DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceSpeed == 0 ) {  // 通过外部HUB与低速USB设备通讯需要前置ID
			UH_SETUP |= bUH_PRE_PID_EN;  // 启用PRE PID
		}
		SetUsbSpeed( DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceSpeed );  // 设置当前USB速度
	}
	else {  // 选择操作指定的ROOT-HUB端口
		SetHostUsbAddr( RootHubDev[RootHubIndex].DeviceAddress );  // 设置USB主机当前操作的USB设备地址
		SetUsbSpeed( RootHubDev[RootHubIndex].DeviceSpeed );  // 设置当前USB速度
	}
	RootHubId = RootHubIndex ? 1 : 0;
}

UINT8	WaitUSB_Interrupt( void )  // 等待USB中断
{
	UINT16	i;
	for ( i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i -- );
	return( UIF_TRANSFER ? ERR_SUCCESS : ERR_USB_UNKNOWN );
}

// CH559传输事务,输入目的端点地址/PID令牌,同步标志,以20uS为单位的NAK重试总时间(0则不重试,0xFFFF无限重试),返回0成功,超时/出错重试
UINT8	USBHostTransact( UINT8 endp_pid, UINT8 tog, UINT16 timeout )  // endp_pid: 高4位是token_pid令牌, 低4位是端点地址
{  // 本子程序着重于易理解,而在实际应用中,为了提供运行速度,应该对本子程序代码进行优化
//	UINT8	TransRetry;
#define	TransRetry	UEP0_T_LEN	// 节约内存
	UINT8	s, r;
	UINT16	i;
	UH_RX_CTRL = UH_TX_CTRL = tog;
	TransRetry = 0;
	do {
//		LED_TMP = 0;
		UH_EP_PID = endp_pid;  // 指定令牌PID和目的端点号
		UIF_TRANSFER = 0;  // 允许传输
//		s = WaitUSB_Interrupt( );
		for ( i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i -- );
		UH_EP_PID = 0x00;  // 停止USB传输
//		LED_TMP = 1;
//		if ( s != ERR_SUCCESS ) return( s );  // 中断超时,可能是硬件异常
		if ( UIF_TRANSFER == 0 ) return( ERR_USB_UNKNOWN );
		if ( UIF_DETECT ) {  // USB设备插拔事件
//			mDelayuS( 200 );  // 等待传输完成
			UIF_DETECT = 0;  // 清中断标志
			s = AnalyzeRootHub( );   // 分析ROOT-HUB状态
			if ( s == ERR_USB_CONNECT ) FoundNewDev = 1;
			if ( RootHubDev[RootHubId].DeviceStatus == ROOT_DEV_DISCONNECT ) return( ERR_USB_DISCON );  // USB设备断开事件
			if ( RootHubDev[RootHubId].DeviceStatus == ROOT_DEV_CONNECTED ) return( ERR_USB_CONNECT );  // USB设备连接事件
//			if ( ( USB_HUB_ST & bUHS_H0_ATTACH ) == 0x00 ) return( ERR_USB_DISCON );  // USB设备断开事件
			mDelayuS( 200 );  // 等待传输完成
		}
		if ( UIF_TRANSFER ) {  // 传输完成
			if ( U_TOG_OK ) return( ERR_SUCCESS );
#ifdef DEBUG_NOW
printf("endp_pid=%02X\n",(UINT16)endp_pid);
printf("USB_INT_FG=%02X\n",(UINT16)USB_INT_FG);
printf("USB_INT_ST=%02X\n",(UINT16)USB_INT_ST);
printf("USB_MIS_ST=%02X\n",(UINT16)USB_MIS_ST);
printf("USB_RX_LEN=%02X\n",(UINT16)USB_RX_LEN);
printf("UH_TX_LEN=%02X\n",(UINT16)UH_TX_LEN);
printf("UH_RX_CTRL=%02X\n",(UINT16)UH_RX_CTRL);
printf("UH_TX_CTRL=%02X\n",(UINT16)UH_TX_CTRL);
printf("UHUB0_CTRL=%02X\n",(UINT16)UHUB0_CTRL);
printf("UHUB1_CTRL=%02X\n",(UINT16)UHUB1_CTRL);
#endif
			r = USB_INT_ST & MASK_UIS_H_RES;  // USB设备应答状态
			if ( r == USB_PID_STALL ) return( r | ERR_USB_TRANSFER );
			if ( r == USB_PID_NAK ) {
				if ( timeout == 0 ) return( r | ERR_USB_TRANSFER );
				if ( timeout < 0xFFFF ) timeout --;
				-- TransRetry;
			}
			else switch ( endp_pid >> 4 ) {
				case USB_PID_SETUP:
				case USB_PID_OUT:
//					if ( U_TOG_OK ) return( ERR_SUCCESS );
//					if ( r == USB_PID_ACK ) return( ERR_SUCCESS );
//					if ( r == USB_PID_STALL || r == USB_PID_NAK ) return( r | ERR_USB_TRANSFER );
					if ( r ) return( r | ERR_USB_TRANSFER );  // 不是超时/出错,意外应答
					break;  // 超时重试
				case USB_PID_IN:
//					if ( U_TOG_OK ) return( ERR_SUCCESS );
//					if ( tog ? r == USB_PID_DATA1 : r == USB_PID_DATA0 ) return( ERR_SUCCESS );
//					if ( r == USB_PID_STALL || r == USB_PID_NAK ) return( r | ERR_USB_TRANSFER );
					if ( r == USB_PID_DATA0 && r == USB_PID_DATA1 ) {  // 不同步则需丢弃后重试
					}  // 不同步重试
					else if ( r ) return( r | ERR_USB_TRANSFER );  // 不是超时/出错,意外应答
					break;  // 超时重试
				default:
					return( ERR_USB_UNKNOWN );  // 不可能的情况
					break;
			}
		}
		else {  // 其它中断,不应该发生的情况
			USB_INT_FG = 0xFF;  /* 清中断标志 */
		}
		mDelayuS( 15 );
	} while ( ++ TransRetry < 3 );
	return( ERR_USB_TRANSFER );  // 应答超时
}

UINT8	HostCtrlTransfer( PUINT8X DataBuf, PUINT8 RetLen )  // 执行控制传输,8字节请求码在pSetupReq中,DataBuf为可选的收发缓冲区
// 如果需要接收和发送数据,那么DataBuf需指向有效缓冲区用于存放后续数据,实际成功收发的总长度保存在ReqLen指向的字节变量中
{
	UINT8	s, RemLen, RxLen, RxCnt, TxCnt;
	PUINT8X	xdata	pBuf;
	PUINT8	xdata	pLen;
	pBuf = DataBuf;
	pLen = RetLen;
	mDelayuS( 200 );
	if ( pLen ) *pLen = 0;  // 实际成功收发的总长度
	UH_TX_LEN = sizeof( USB_SETUP_REQ );
	s = USBHostTransact( USB_PID_SETUP << 4 | 0x00, 0x00, 200000/20 );  // SETUP阶段,200mS超时
	if ( s != ERR_SUCCESS ) return( s );
	UH_RX_CTRL = UH_TX_CTRL = bUH_R_TOG | bUH_R_AUTO_TOG | bUH_T_TOG | bUH_T_AUTO_TOG;  // 默认DATA1
	UH_TX_LEN = 0x01;  // 默认无数据故状态阶段为IN
	RemLen = pSetupReq -> wLengthH ? 0xFF : pSetupReq -> wLengthL;
	if ( RemLen && pBuf ) {  // 需要收发数据
		if ( pSetupReq -> bRequestType & USB_REQ_TYP_IN ) {  // 收
			while ( RemLen ) {
				mDelayuS( 200 );
				s = USBHostTransact( USB_PID_IN << 4 | 0x00, UH_RX_CTRL, 200000/20 );  // IN数据
				if ( s != ERR_SUCCESS ) return( s );
				RxLen = USB_RX_LEN < RemLen ? USB_RX_LEN : RemLen;
				RemLen -= RxLen;
				if ( pLen ) *pLen += RxLen;  // 实际成功收发的总长度
//				memcpy( pBuf, RxBuffer, RxLen );
//				pBuf += RxLen;
				for ( RxCnt = 0; RxCnt != RxLen; RxCnt ++ ) {
					*pBuf = RxBuffer[ RxCnt ];
					pBuf ++;
				}
				if ( USB_RX_LEN == 0 || ( USB_RX_LEN & ( UsbDevEndp0Size - 1 ) ) ) break;  // 短包
			}
			UH_TX_LEN = 0x00;  // 状态阶段为OUT
		}
		else {  // 发
			while ( RemLen ) {
				mDelayuS( 200 );
				UH_TX_LEN = RemLen >= UsbDevEndp0Size ? UsbDevEndp0Size : RemLen;
//				memcpy( TxBuffer, pBuf, UH_TX_LEN );
//				pBuf += UH_TX_LEN;
				if(pBuf[1] == 0x09)//类命令
        {
            Set_Port = Set_Port^1 ? 1:0;
					  *pBuf = Set_Port;
				    printf("SET_PORT  %02X  %02X ",(UINT16)(*pBuf),(UINT16)(Set_Port));
        }
				for ( TxCnt = 0; TxCnt != UH_TX_LEN; TxCnt ++ ) {
					 TxBuffer[ TxCnt ] = *pBuf;
					 pBuf ++;
				}
				s = USBHostTransact( USB_PID_OUT << 4 | 0x00, UH_TX_CTRL, 200000/20 );  // OUT数据
				if ( s != ERR_SUCCESS ) return( s );
				RemLen -= UH_TX_LEN;
				if ( pLen ) *pLen += UH_TX_LEN;  // 实际成功收发的总长度
			}
//			UH_TX_LEN = 0x01;  // 状态阶段为IN
		}
	}
	mDelayuS( 200 );
	s = USBHostTransact( ( UH_TX_LEN ? USB_PID_IN << 4 | 0x00: USB_PID_OUT << 4 | 0x00 ), bUH_R_TOG | bUH_T_TOG, 200000/20 );  // STATUS阶段
	if ( s != ERR_SUCCESS ) return( s );
	if ( UH_TX_LEN == 0 ) return( ERR_SUCCESS );  // 状态OUT
	if ( USB_RX_LEN == 0 ) return( ERR_SUCCESS );  // 状态IN,检查IN状态返回数据长度
	return( ERR_USB_BUF_OVER );  // IN状态阶段错误
}

