openwch/ch55x/4,CH559 operates Barcode Scanner/USBH_ScannerKey.C
UINT8	EnumAllHubPort( void )  // 枚举所有ROOT-HUB端口下外部HUB后的二级USB设备
{
	UINT8	s, RootHubIndex;
	printf( "EnumAllHubPort\n" );
	for ( RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++ ) {
		if ( RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS && RootHubDev[RootHubIndex].DeviceType == USB_DEV_CLASS_HUB ) {  // HUB枚举成功
			SelectHubPort( RootHubIndex, 0 );  // 选择操作指定的ROOT-HUB端口,设置当前USB速度以及被操作设备的USB地址
//			做点什么?  给HUB各端口上电,查询各端口状态,初始化有设备连接的HUB端口,初始化设备
			s = EnumHubPort( RootHubIndex );  // 枚举指定ROOT-HUB端口上的外部HUB集线器的各个端口,检查各端口有无连接或移除事件
			if ( s != ERR_SUCCESS ) {  // 可能是HUB断开了
				printf( "EnumAllHubPort err = %02X\n", (UINT16)s );
			}
			SetUsbSpeed( 1 );  // 默认为全速
		}
	}
	return( ERR_SUCCESS );
}

UINT16	SearchTypeDevice( UINT8 type )  // 在ROOT-HUB以及外部HUB各端口上搜索指定类型的设备所在的端口号,输出端口号为0xFFFF则未搜索到
{// 输出高8位为ROOT-HUB端口号,低8位为外部HUB的端口号,低8位为0则设备直接在ROOT-HUB端口上
// 当然也可以根据USB的厂商VID产品PID进行搜索(事先要记录各设备的VID和PID),以及指定搜索序号
	UINT8	RootHubIndex, HubPortIndex;
	for ( RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++ ) {  // 现时搜索可以避免设备中途拔出而某些信息未及时更新的问题
		if ( RootHubDev[RootHubIndex].DeviceType == type && RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS ) return( (UINT16)RootHubIndex << 8 );  // 类型匹配且枚举成功,在ROOT-HUB端口上
		if ( RootHubDev[RootHubIndex].DeviceType == USB_DEV_CLASS_HUB && RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS ) {  // 外部集线器HUB且枚举成功
			for ( HubPortIndex = 1; HubPortIndex <= RootHubDev[RootHubIndex].GpVar; HubPortIndex ++ ) {  // 搜索外部HUB的各个端口
				if ( DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType == type && DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus >= ROOT_DEV_SUCCESS )
					return( ( (UINT16)RootHubIndex << 8 ) | HubPortIndex );  // 类型匹配且枚举成功
			}
		}
	}
	return( 0xFFFF );
}

/* 为printf和getkey输入输出初始化串口 */
void	mInitSTDIO( void )
{
//	SCON = 0x50;
	SM0 = 0;
	SM1 = 1;
	SM2 = 0;
	REN = 1;
	PCON |= SMOD;
	TMOD = TMOD & ~ bT1_GATE & ~ bT1_CT & ~ MASK_T1_MOD | bT1_M1;  // 0X20
	T2MOD = T2MOD & ~(bTMR_CLK | bT1_CLK);  // *12
	TH1 = 0-13;//0xF3;  /* 12MHz晶振, 4800bps*12=57600bps */
	TR1 = 1;
	TI = 1;
}

void	InitUSB_Host( void )  // 初始化USB主机
{
	UINT8	i;
	IE_USB = 0;
//	LED_CFG = 1;
//	LED_RUN = 0;
	USB_CTRL = bUC_HOST_MODE;  // 先设定模式
	USB_DEV_AD = 0x00;
	UH_EP_MOD = bUH_EP_TX_EN | bUH_EP_RX_EN ;
	UH_RX_DMA = RxBuffer;
	UH_TX_DMA = TxBuffer;
	UH_RX_CTRL = 0x00;
	UH_TX_CTRL = 0x00;
	USB_CTRL = bUC_HOST_MODE | bUC_INT_BUSY | bUC_DMA_EN;  // 启动USB主机及DMA,在中断标志未清除前自动暂停
//	UHUB0_CTRL = 0x00;
//	UHUB1_CTRL = 0x00;
	UH_SETUP = bUH_SOF_EN;
	USB_INT_FG = 0xFF;  // 清中断标志
	for ( i = 0; i != 2; i ++ ) DisableRootHubPort( i );  // 清空
	USB_INT_EN = bUIE_TRANSFER | bUIE_DETECT;
//	IE_USB = 1;  // 查询方式
}


UINT8 SETorOFFNumLock(PUINT8 buf)//NumLock的点灯判断
{
    UINT8 tmp[]={0x21,0x09,0x00,0x02,0x00,0x00,0x01,0x00};
    UINT8 len,s;
    if((buf[2]==0x53)&(buf[0]|buf[1]|buf[3]|buf[4]|buf[5]|buf[6]|buf[7]==0))
    {
	    for ( s = 0; s != sizeof( tmp ); s ++ ) {
		   ((PUINT8X)pSetupReq)[ s ] = tmp[s];
	    }
        s = HostCtrlTransfer( TxBuffer, &len );  // 执行控制传输
	      if ( s != ERR_SUCCESS ) return( s );    
    }
	return( ERR_SUCCESS );
}

void USBKeyToASCII( )
{
 UINT8 Tmp;
//  printf( "RxBuffer %02x\n",(UINT16)RxBuffer[2] );
 if((RxBuffer[2] == 0)&&(RxBuffer[3] == 0)) return;//释放按键
 if((RxBuffer[0] == 0x20)&&(RxBuffer[2] == 0x26)) {printf("(");return;}
 if((RxBuffer[0] == 0x20)&&(RxBuffer[2] == 0x27)) {printf(")");return;}
 if(RxBuffer[2] == 0x27) {printf("0");return;}	
 if((RxBuffer[2] >= 0x1E)&&(RxBuffer[2] <= 0x26))
 {
   Tmp = RxBuffer[2]-0x1E+'1';
   printf("%c",Tmp);return;
 }	 
}
main( ) {
	UINT8	i, s, len, endp;
	UINT16	loc;
    SAFE_MOD = 0x55;                                                   //开启安全模式
    SAFE_MOD = 0xAA;
	  CLOCK_CFG &= ~MASK_SYS_CK_DIV;
    CLOCK_CFG |= 12;                                                    //配置系统时钟 
    SAFE_MOD = 0xFF;                                                   //关闭安全模式
	mInitSTDIO( );  /* 为了让计算机通过串口监控演示过程 */
	printf( "Start @ChipID=%02X\n", (UINT16)CHIP_ID );
	InitUSB_Host( );
	FoundNewDev = 0;
	printf( "Wait Device In\n" );
	while ( 1 ) {
// 		for(i=0x1e;i<=0x27;i++)
//     {
//       RxBuffer[2] = i;			
//       USBKeyToASCII( );			
//       mDelaymS(100);			
//     }
		s = ERR_SUCCESS;
		if ( UIF_DETECT ) {  // 如果有USB主机检测中断则处理
			UIF_DETECT = 0;  // 清中断标志
			s = AnalyzeRootHub( );   // 分析ROOT-HUB状态
			if ( s == ERR_USB_CONNECT ) FoundNewDev = 1;
		}

		if ( FoundNewDev || s == ERR_USB_CONNECT ) {  // 有新的USB设备插入
			FoundNewDev = 0;
			mDelaymS( 200 );  // 由于USB设备刚插入尚未稳定,故等待USB设备数百毫秒,消除插拔抖动
			s = EnumAllRootDevice( );  // 枚举所有ROOT-HUB端口的USB设备
			if ( s != ERR_SUCCESS ) printf( "EnumAllRootDev err = %02X\n", (UINT16)s );
		}
//		other work for each device
// 		mDelaymS( 100 );  // 模拟单片机做其它事
    // 用定时模拟主观需求,需要操作键盘
				loc = SearchTypeDevice( DEV_TYPE_KEYBOARD );  // 在ROOT-HUB以及外部HUB各端口上搜索指定类型的设备所在的端口号
				if ( loc != 0xFFFF ) {  // 找到了,如果有两个KeyBoard如何处理?
// 					printf( "Query Keyboard @%04X\n", loc );
					i = (UINT8)( loc >> 8 );
					len = (UINT8)loc;
					SelectHubPort( i, len );  // 选择操作指定的ROOT-HUB端口,设置当前USB速度以及被操作设备的USB地址
					endp = len ? DevOnHubPort[i][len-1].GpVar : RootHubDev[i].GpVar;  // 中断端点的地址,位7用于同步标志位
// 										printf("%02X  ",endp);
					if ( endp & USB_ENDP_ADDR_MASK ) {  // 端点有效
						s = USBHostTransact( USB_PID_IN << 4 | endp & 0x7F, endp & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );  // CH559传输事务,获取数据,NAK不重试
						if ( s == ERR_SUCCESS ) {
							endp ^= 0x80;  // 同步标志翻转
							if ( len ) DevOnHubPort[i][len-1].GpVar = endp;  // 保存同步标志位
							else RootHubDev[i].GpVar = endp;
							len = USB_RX_LEN;  // 接收到的数据长度
							if ( len ) {
								  USBKeyToASCII( );
// 								SETorOFFNumLock(RxBuffer);
// 								printf("keyboard data: ");
// 								for ( i = 0; i < len; i ++ ) printf("x%02X ",(UINT16)(RxBuffer[i]) );
// 								printf("\n");
							}
						}
// 						else if ( s != ( USB_PID_NAK | ERR_USB_TRANSFER ) ) printf("keyboard error %02x\n",(UINT16)s);  // 可能是断开了
					}
// 					else printf("keyboard no interrupt endpoint\n");
					SetUsbSpeed( 1 );  // 默认为全速
				}
	}
}
